Enterprise_Serivces/Prod/Bronze2/CSLAssociationService/CSLClientService/result1/Iteration1/t3_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/csl/client/contracts/2010/05/IClientService/ChangeClientByClientKey</wsa:Action><wsa:MessageID>uuid:6bba8304-2306-466c-b1da-ff33c899c6df</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslclientserviceqa1.testgs.pvt/ClientService.svc</wsa:To></soap:Header><soap:Body><ChangeClientByClientKey xmlns="http://www.gamestop.com/services/csl/client/contracts/2010/05"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><CallbackUrl xmlns="http://www.gamestop.com/services/csl/client/contracts/messages/2010/05">http://test.com</CallbackUrl><ClientKey xmlns="http://www.gamestop.com/services/csl/client/contracts/messages/2010/05">[ClientKey]</ClientKey><Name xmlns="http://www.gamestop.com/services/csl/client/contracts/messages/2010/05">abc123</Name></request></ChangeClientByClientKey></soap:Body></soap:Envelope>